# 関数プログラミング入門 Haskellで学ぶ原理と技法 第3章
[全体目次へ戻る](../index.md)

## 3章 数値
### 自然数
```haskell
data Nat = Zero | Succ Nat

(+) :: Nat -> Nat -> Nat
m + Zero   = m
m + Succ n = Succ (m + n)

(*) :: Nat -> Nat -> Nat
m * Zero = Zero
m * Succ n = (m * n) + m

(^) :: Nat -> Nat -> Nat
m ^ Zero = Succ Zero
m ^ Succ n = (m ^ n) * m

instance Ord Nat where
  Zero < Zero =   False
  Zero < Succ n   = True
  Succ m < Zero   = False
  Succ m < Succ n = (m < n)
```

- `Nat`は再帰的データ型宣言になっている(宣言の右辺に`Nat`自身が現れている)
- `Nat`の値すべてがWell-definedな自然数で表現できるわけではない(`_|_,` `Succ _|_`, `Succ (Succ _|_)`...)

- 自然数上での減算は部分演算である
  + m < n のとき m - n は定義できない。haskellではパターンマッチの失敗、すなわち⊥として表現される

```haskell
(-) :: Nat -> Nat -> Nat
m - Zero        = m
Succ m - Succ n = m - n
```

- `Nat`を用いたプログラムの例

```haskell
fact :: Nat -> Nat
fact Zero = Succ Zero
fact (Succ n) = Succ n * fact n

fib :: Nat -> Nat
fib Zero = Zero
fib (Succ Zero) = Succ Zero
fib Succ (Succ n) = fib (Succ n) + fib n
```

#### 擬数
- `_|_`, `Succ _|_`, `Succ (Succ _|_)`のような値は何を表現するのか?
  + `_|_`は何の情報もない自然数
  + `Succ _|_`は「`Zero`より大きい」以外の情報がない自然数
  + `Succ (Succ _|_)`は「`Succ Zero`より大きい」以外の情報がない自然数

```haskell
-- undefined :: Nat
-- undefined = undefined
> Zero < undefined
-- 無限ループ

> Zero < Succ undefined
-- True

> Succ Zero < Succ undefined
-- 無限ループ

> Succ Zero < Succ (Succ undefined)
-- True
```

- 無限大は以下のように定義される。これは通常の自然数、擬数に続くもう1つの`Nat`値である

```haskell
infinity :: Nat
infinity = Succ infinity
```

- このような分類は、あらゆる再帰型について成り立つ
  + 有限値
  + 擬値
  + 無限値

***

[前へ](c2.md) /
[全体目次へ戻る](../index.md) /
[次へ](c4.md)
